import React, {useState, useRef, useEffect } from "react";
import ReactDOM from "react-dom";

function Article1(){
    return (
        <>
            <div className="highlights">Музыка&nbsp;&mdash; это неотъемлемая часть нашей жизни: она с&nbsp;нами в&nbsp;абсолютно разные моменты. И&nbsp;в&nbsp;спорте в&nbsp;том числе. Вы&nbsp;знали, что правильные мелодии и&nbsp;ритмы способны помочь достигать ощутимых результатов в&nbsp;вашем фитнес-путешествии? Мы&nbsp;насчитали для вас девять поводов для того, чтобы подготовить плейлист и&nbsp;взять с&nbsp;собой наушники на&nbsp;следующую тренировку.</div>
            <div className="boximg"><img className="img-fluid" src="./assets/img/articles/1/1.jpg" /></div>
            <h3>1. Музыка выведет вас за&nbsp;дверь</h3>
            <p>Нет желания надеть кроссовки и&nbsp;выйти из&nbsp;дома? Пора включить музыку. Она замотивирует двигаться вперед. Прослушивание ритмичных мелодий может помочь начать пробежку и&nbsp;побудит вас продолжать&nbsp;ее.</p>
            <h3>2. Вы&nbsp;будете работать усерднее, даже не&nbsp;замечая этого</h3>
            <p>Чувствуете, что ваш прогресс замедляется? Попробуйте добавить к&nbsp;следующему занятию несколько заранее выбранных песен. В&nbsp;<a href="https://pubmed.ncbi.nlm.nih.gov/25202850/">исследовании 2015 года</a><sup>4</sup> участники более усердно крутили педали во&nbsp;время прослушивания музыки, но&nbsp;они не&nbsp;воспринимали дополнительные усилия более сложными, чем когда делали это без музыки.</p>
            <p>Согласно одной из&nbsp;теорий, действие музыки сравнимо с&nbsp;эффектом метронома, который может задавать хороший бит. Правильная песня способна помочь вам поддерживать стабильный темп и&nbsp;отвлекаться от&nbsp;сложности тренировки.</p>
            <h3>3. Музыка может подбодрить вас</h3>
            <p>Мелодия поднимет вам настроение и&nbsp;подготовит к&nbsp;вызову. Помимо темпа и&nbsp;громкости, которые способны влиять на&nbsp;ваши действия, важны чувства, которые вы&nbsp;испытываете во&nbsp;время прослушивания. Не&nbsp;существует идеальной музыки для тренировок. Воспоминания, которые вызывают песни&nbsp;&mdash; или даже текст песни,&nbsp;&mdash; это невероятно мощный и&nbsp;личный инструмент.</p>
            <div className="boximg"><img className="img-fluid" src="./assets/img/articles/1/2.jpg" /></div>
            <h3>4. Музыка может вас успокоить</h3>
            <p>Да, порой мы&nbsp;слишком возбуждены. Медленная музыка может помочь вам снизить частоту сердечных сокращений и&nbsp;уменьшить беспокойство перед соревнованием, игрой или особенно интенсивной тренировкой. Тексты песен и&nbsp;ваше отношение к&nbsp;данной музыке способны повлиять на&nbsp;ваши эмоции и&nbsp;помогут вам восстановить контроль.</p>
            <h3>5. Музыка улучшает координацию</h3>
            <p>Вам не&nbsp;обязательно танцевать в&nbsp;такт, чтобы музыка влияла на&nbsp;вашу моторику. Независимо от&nbsp;ваших движений, мелодия побуждает вас двигаться ритмично. В&nbsp;2010 году группа ученых <a href="https://pubmed.ncbi.nlm.nih.gov/19585590/">изучила</a><sup>5</sup> эстетическое восприятие музыки атлетами. Было обнаружено, что прослушивание человеком полюбившихся ему музыкальных ритмов увеличивает электрическую активность в&nbsp;областях его мозга, отвечающих за&nbsp;координацию движений. Очевидно, поэтому хороший ритм облегчает выполнение занятий по&nbsp;аэробике или HIIT.</p>
            <div className="boximg"><img className="img-fluid" src="./assets/img/articles/1/3.jpg" /></div>
            <h3>6. Музыка расширяет ваши границы</h3>
            <p>Ничто так не&nbsp;тормозит тренировку, как утомление. Музыка поможет изменить ваше восприятие ограничений, сняв часть вашей усталости. В&nbsp;ходе небольшого <a href="https://pubmed.ncbi.nlm.nih.gov/19793214/">исследования &laquo;Влияние темпа музыки на&nbsp;субмаксимальную производительность при езде на&nbsp;велосипеде&raquo;</a><sup>6</sup>  12&nbsp;участников, которые во&nbsp;время занятий на&nbsp;велосипеде слушали музыку в&nbsp;разном темпе, усерднее работали при более быстрой музыке, чем с&nbsp;более медленными песнями.</p>
            <h3>7. Музыка делает тяжелую тренировку более приятной</h3>
            <p>Прослушивание мелодии делает тренировку еще более приятной, чем просто просмотр видео без звука. Почему? Потому что чем сильнее вы&nbsp;способны отвлечься от&nbsp;неприятных ощущений во&nbsp;время тренировки, тем лучше вы&nbsp;себя чувствуете. Хороший плейлист также может помочь снизить воспринимаемый вами уровень нагрузки или&nbsp;то, насколько усердно, по&nbsp;вашему мнению, вы&nbsp;работаете во&nbsp;время выполнения упражнений низкой и&nbsp;средней интенсивности.</p>
            <div className="boximg"><img className="img-fluid" src="./assets/img/articles/1/4.jpg" /></div>
            <h3>8. Но&nbsp;музыка может и&nbsp;слишком отвлечь вас</h3>
            <p>Когда вы&nbsp;тренируетесь в&nbsp;такт, легко забыть о&nbsp;технике движения или о&nbsp;том, как себя чувствует ваше тело. Вот вам совет: будьте внимательны, следите за&nbsp;своим выполнением и&nbsp;во&nbsp;избежание травм убавляйте музыку, когда вам нужно сосредоточиться на&nbsp;трудном движении.</p>
            <p>9. Музыка ускоряет ваше восстановление</p>
            <p>С&nbsp;помощью медленных упражнений вы&nbsp;сможете снизить частоту пульса и&nbsp;быстрее восстановиться в&nbsp;конце тренировки. Но&nbsp;знаете&nbsp;ли вы, что спокойная музыка способна снижать артериальное давление, замедлить сердечный ритм и&nbsp;ускорить ваше восстановление? В&nbsp;2014 году ученые <a href="http://www.iosrjournals.org/iosr-jdms/papers/Vol13-issue5/Version-1/N013516064.pdf">исследовали</a><sup>7</sup> влияние разных темпов музыки на&nbsp;восстановление после тренировки у&nbsp;60&nbsp;молодых людей. И&nbsp;было отмечено, что восстановление под медленную мелодию происходило быстрее, чем в&nbsp;тишине или с&nbsp;быстрой музыкой.</p>
            <p>Хочется слушать музыку во&nbsp;время тренировок с&nbsp;<strong>б&oacute;льшим</strong> комфортом? В&nbsp;этом вам могут помочь наушники Samsung Galaxy Buds2&nbsp;с технологией активного шумоподавления&nbsp;&mdash; с&nbsp;ними вы&nbsp;будете наслаждаться звучанием любимых ритмов во&nbsp;время выполнения упражнений, не&nbsp;отвлекаясь на&nbsp;посторонние звуки. Продуманный дизайн наушников обеспечивает их&nbsp;удобную и&nbsp;комфортную посадку при любой смене положения тела или активных движениях, что позволит вам погрузиться в&nbsp;атмосферу комфортного фитнеса и&nbsp;подарит максимальное удовольствие даже при длительном использовании. То, что нужно для эффективной тренировки!</p>
            
    </>
        )
}

export default Article1