import React, { useRef, useState, useEffect, useLayoutEffect } from "react";
import LinkGA from "../GoogleAnalytics/LinkGA";
import Slider from "react-slick";
import SlickSlider from "../SlickSlider";
import Typograff from "../Typograff";
import Html from "../Html";
const slickSettings = {
  dots: true,
  infinite: true,
  speed: 500,
  slidesToShow: 1,
  slidesToScroll: 1
};

const db = [
  /*{
    id: "nov_25",
    date: "25 ноября",
    hint: "Часть 1. Открывая «ГЭС-2»",
    reactcontent: <>
              <Typograff>
              {`<p><strong>Возвращаемся в офлайн.<strong>Во время пандемии сфера культуры показала невероятную адаптивность: иммерсивные шоу в игровых вселенных, аукционы «на диване», трансляции балета и походы в музеи прямо в зуме. В этой реальности будто сформировалась новая привычка: не выходи из комнаты, не трать время. Но все же полноценное восприятие материального мира невозможно без глубокого погружения: необходимо трогать, нюхать, ощущать температуру, наблюдать за игрой света, находить себя в пространстве. За девять дней до открытия нового культурного пространства, в центре которого — изучение взаимодействий человека с внешней средой, предлагаем исследовать физический мир, опираясь на опыт по крайней мере двух пережитых локдаунов.</p>
                <h1>Как подготовиться?</h1>
                <ul class="list_esq"><li>Полистать книгу Йохана Идемы «Как ходить в музей. Советы о том, как сделать посещение по-настоящему запоминающимся».</li>
                <li>Познакомиться со скульптурой Урса Фишера «Большая глина №4» рядом с «ГЭС-2», описать фактуру, ощущения от материала.</li>
                <li>Зафиксировать свои ощущения от нахождения вблизи со сталинскими высотками и малоэтажными особняками XIX века. В чем разница? Какие здания делают нас маленьким, а какие — наоборот? Что заставляет нас идти быстрее, а что делает нашу походку более расслабленной?</li>
                </ul>
                `}
              </Typograff>
              <SlickSlider numOfSLides="4" id="nov_25" fileType=".jpg"/>
              <Html>{`<iframe src="https://open.spotify.com/embed/playlist/0aWm5tlnNanidA6msZW2Kb?utm_source=generator&theme=0" width="250" height="80" frameBorder="0" allowfullscreen="" allow="autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture"></iframe>`}</Html>
              </>
  },*/
  {
    id: "nov_25",
    date: "25 ноября",
    hint: "Часть 1. Открывая «ГЭС-2»",
    reactcontent: <>
              <Typograff>
              {`<div class="date_about">
                  <p><b>Возвращаемся в офлайн.</b> Во время пандемии сфера культуры показала невероятную адаптивность: иммерсивные шоу в игровых вселенных, аукционы «на диване», трансляции балета и походы в музеи прямо в зуме. В этой реальности будто сформировалась новая привычка: не выходи из комнаты, не трать время. Но все же полноценное восприятие материального мира невозможно без глубокого погружения: необходимо трогать, нюхать, ощущать температуру, наблюдать за игрой света, находить себя в пространстве. За девять дней до открытия нового культурного пространства, в центре которого — изучение взаимодействий человека с внешней средой, предлагаем исследовать физический мир, опираясь на опыт по крайней мере двух пережитых локдаунов.</p>
                </div>
                
                <div class="howto">Как подготовиться?</div>
                <ul class="list_esq">
                  <li>Полистать книгу Йохана Идемы «Как ходить в музей. Советы о том, как сделать посещение по-настоящему запоминающимся».</li>
                  <li>Познакомиться со скульптурой Урса Фишера «Большая глина №4» рядом с «ГЭС-2», описать фактуру, ощущения от материала.</li>
                  <li>Зафиксировать свои ощущения от нахождения вблизи со сталинскими высотками и малоэтажными особняками XIX века. В чем разница? Какие здания делают нас маленькими, а какие — наоборот? Что заставляет нас идти быстрее, а что делает нашу походку более расслабленной?</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="4" id="nov_25" fileType=".gif"/>
              </div>
              
              
              </>
  },
  
  {
    id: "nov_26",
    date: "26 ноября",
    hint: "",
    reactcontent: <>
              <Typograff>
              {`<div class="date_about"><p><strong>Критикуем сериалы.</strong> Сразу же после открытия 4 декабря «ГЭС-2» представит проект «Еще одну: к опыту сериальной культуры» — о феномене сериалов в наши дни. Под кураторством Андрея Василенко и Саши Хазиной участники обсудят художественную форму сериалов и то, как они влияют на современную культуру.</p></div>
                <div class="howto">Как подготовиться?</div>
                <ul class="list_esq"><li>Посмотреть несколько серий «Санта-Барбары» в компании друзей.</li>
                <li>Подискутировать с ними о том, как устроено пространство и время в сериале.</li>
                <li>Полистать номера журнала «Искусство кино» (выпуски ⅚ и ⅞, за 2020 год), посвященные сериалам.</li>
                <li>Выбрать сериал к просмотру из списка рекомендаций кураторов программы: «Дикие пальмы» (1993), «Клиника» (2001), «Безумцы» (Mad Men, 2007), «Видеть» (2019), «Великая» (2020).</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="nov_26"/>
              </div>
              </>
  },

  {
    id: "nov_27",
    date: "27 ноября",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Думаем о том, почему искусство вызывает эмоции.</b> Опыт взаимодействия с художественным произведением может вызвать у зрителя психическое навязчивое состояние. Дело может дойти до самостоятельного разрушения художественных образов — вандализма или до принятия радикальной миссии — социальной борьбы против искусства. Подобные проявления стали темой фестиваля-конференции «Шок и слава», который пройдет 12 декабря в «ГЭС-2». Это ответ на видеоинсталляцию Рагнара Кьяртанссона «Грозный-прегрозный», в которой художник обращается к известной истории нападения на полотно Ильи Репина «Иван Грозный и сын его Иван 16 ноября 1581 года».</p>
                <div class="howto">Как подготовиться?</div>
                <ul class="list_esq"><li>Пойти в Эрмитаж и посмотреть на «Данаю» Рембрандта: под каким углом света виден восстановленный красочный слой? </li>
                <li>Полистать книгу Софьи Багдасаровой «Воры, вандалы и идиоты» — и узнать о краже искусства по-русски.</li>
                <li>Посмотреть фильм «Русский ковчег» Александра Сокурова и подумать о том, что русский человек ценит в искусстве.</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="nov_27"/>
              </div>
              </>
  },
  
  {
    id: "nov_28",
    date: "28 ноября",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Ищем шестое чувство.</b> Сегодня современное искусство, взаимодействуя со зрителем, обращается к его чувствам — и в первую очередь ассоциируется со зрительным опытом. Но это лишь один из способов считывания окружающего мира. Чтобы изучить свои чувства и применить эти знания в диалоге с искусством, «ГЭС-2» под кураторством Кати Порутчик и Полины Зотовой построит комнату сенсорных впечатлений с интерактивной средой, которая «перенастроит» нашу чувственную сторону.</p>
                <div class="howto">Как подготовиться?</div>
                <ul class="list_esq"><li>Послушать курс на Arzamas <a href="https://arzamas.academy/courses/61" target="_blank"  rel="noreferrer noopener">«Антропология чувств»</a>.</li><li>Посвятить день наблюдениям за своими чувствами. Подумайте, что вы неосознанно игнорируете: запахи, звуки, колорит пространства, вкусы, собственное тело, температуру?</li><li> Полистать книгу Оливера Сакса «Человек, который принял жену за шляпу».</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="5" id="nov_28"/>
              </div>
              </>
  },
  
  {
    id: "nov_29",
    date: "29 ноября",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Домашнее задание: следим за эмоциями.</b> Анализ собственных и чужих переживаний — важное дело в любой коммуникации. В «Школе эмоционального здоровья», которая пройдет с 14 декабря по 1 марта 2022 года, участники поговорят об эмоциональной грамотности, попробуют изучить причины интереса к практикам осознанности и эмоциональному интеллекту и то, как они отражаются на представлениях о любовных, семейных, дружеских отношениях и этике общения в социуме.</p>
              <div class="howto">Как подготовиться?</div>
                <ul class="list_esq">
                  <li>Полистать книгу “Управляемое сердце: коммерциализация чувств” Арли Рассела Хокшилда</li>
                  <li>Посмотреть фильм “Беззаботная” Майка Ли (Happy-Go-Lucky, 2008) или “Разжимая кулаки” Киры Коваленко (2021)</li>
                  <li>Начать записывать свои эмоции и учиться понимать свои чувства — вам это пригодится в декабре.</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="nov_29"/>
              </div>
              </>
  },
  
  {
    id: "nov_30",
    date: "30 ноября",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Становимся серыми гусями.</b> В программе Дома культуры запланирован курс телесных воркшопов «Бег серого гуся» врача лечебной физкультуры и спортивной медицины Петра Попова. Участники попробуют освоить техники бега и ходьбы, основанные на изучении природы движений серых гусей и только-только научившихся ходить детей. Все для того, чтобы сделать бег приятной ежедневной активностью в городской среде. Курс начинается в декабре, а заканчивается в феврале 2022 года.</p>
                <div class="howto">Как подготовиться?</div>
                <ul class="list_esq">
                  <li>Посмотреть лекции Петра Попова: <a href="https://www.youtube.com/watch?v=qsi2HmGj6Cg&list=PLIrwHtmsKaIxn-f7oOuxobMavkT63e3hH" target="_blank"  rel="noreferrer noopener">«Вводный теоретический курс»</a>, <a href="https://www.youtube.com/watch?v=tKSAgUWnpAw&list=PLIrwHtmsKaIxn-f7oOuxobMavkT63e3hH&index=3" target="_blank"  rel="noreferrer noopener">«Разминку»</a>, <a href="https://www.youtube.com/watch?v=iJFEuDsib88&list=PLIrwHtmsKaIxn-f7oOuxobMavkT63e3hH&index=10" target="_blank"  rel="noreferrer noopener">«Бег»</a>, <a href="https://www.youtube.com/watch?v=iTIdgX4SyoU" target="_blank"  rel="noreferrer noopener">«О беге в городском пространстве»</a>, <a href="https://www.youtube.com/watch?v=OkXhnnkpPo8" target="_blank"  rel="noreferrer noopener">«Отзыв»</a>, <a href="https://www.youtube.com/watch?v=tZBjIUqiItY" target="_blank"  rel="noreferrer noopener">«Качели под одеялом»</a>.</li>
                  <li>Посмотреть, как <a href="https://www.youtube.com/watch?v=yftuU7qIFOY" target="_blank"  rel="noreferrer noopener">летают</a> серые гуси, или выйти во двор — понаблюдать, как бегают дети.</li>
                  <li>Устроить небольшую пробежку по Болотной набережной ради удовольствия — начать от Большого Москворецкого моста, минуя здание «ГЭС-2», и остановиться на стрелке, где заканчивается «Красный Октябрь». Одевайтесь теплее и не забывайте про разминку.</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="nov_30"/>
              </div>
              </>
  },
  
  {
    id: "dec_1",
    date: "1 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Разбираемся в мифологии русскости.</b> Программа «Сцены из русской культуры» запускается в январе и посвящена исследованию мифологии «русскости» — постоянно воспроизводящимся внутри культуры нарративам о некой исконной «русскости», которая якобы наиболее точно определяет, кто мы есть на самом деле.</p>
                <p>Среди событий программы — ридинг-группа по мотивам «Романа» Владимира Сорокина, собравшего все типичные размышления русского классического романа: о родной природе и простом русском мужике, споре западников и славянофилов, особой святости русского народа и загадочной русской душе.</p>
                <div class="howto">Как подготовиться?</div>
                <ul class="list_esq">
                  <li>Познакомиться с текстом проекта «Основы государственной культурной политики в РФ» — какие ценности и идеалы в его основе?</li>
                  <li>Прочитать пьесу «Сван» Андрея Родионова и Катерины Троепольской — антиутопию о России будущего, в которой желающим получить гражданство необходимо сдать экзамен по стихосложению.</li>
                  <li>Послушать американскую техно-группу Drexciya — пригодится на воркшопе с Георгием Мамедовым.</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="4" id="dec_1"/>
              </div>
              </>
  },
  
  {
    id: "dec_2",
    date: "2 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Отдыхаем outdoor.</b> Впереди насыщенная программа сезона — с 4 декабря по 13 марта 2022 года, но не забывайте, что Дом культуры «ГЭС-2» — это еще и приятное место для прогулок по внутреннему дворику, наслаждения пейзажами зимней Москвы и современной архитектурой Ренцо Пьяно.</p>
                <div class="howto">Как подготовиться?</div>
                <ul class="list_esq">
                  <li>Приобрести теплую шапку для приятных прогулок.</li>
                  <li><a href="https://www.admagazine.ru/architecture/intervyu-s-renco-pyano" target="_blank"  rel="noreferrer noopener">Почитать</a> об архитектуре Ренцо Пьяно.</li>
                  <li>Изучить меню горячих напитков пекарни «ХЛЕБ-2»: рождественские пунши, бодрящий кофе, эстетическая матча и душевный чай.</li>
                </ul>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_2"/>
              </div>
              </>
  },
  
  {
    id: "dec_3",
    date: "3 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Последние приготовления.</b> «ГЭС-2» — институция-рассказчик. В первом сезоне «Санта-Барбара». Как не поддаться колонизации?» повествование строится вокруг истории современной России.</p>
                <p>Первый компонент сезона — проект «”Санта-Барбара”. Живая скульптура Рагнара Кьяртанссона», в рамках которого прямо на территории Дома культуры «переснимут» «Санта-Барбару». Второй — выставка «В Москву! В Москву! В Москву!», которая выстроена как диалог Рагнара Кьяртанссона с другими художниками. Третья часть — проект «Я моторы гондолы разбираю на части. Карнавал в четырех действиях», посвященный карнавальной смеховой культуре в России: выставка, танцевальная процессия, стендап-программа и рейв.</p>
                <p>Перед погружением в произведение обычно знакомятся с его структурой и намечают моменты для будущего осмысления. Так же и наш адвент-календарь: он обращает внимание на события Дома культуры и знакомит вас с характером пространства. Прекрасным помощником будет и официальный сайт Дома культуры «ГЭС-2». Хороший рассказчик всегда начинает с главного — с контекста.</p>

                `}
              </Typograff>
              <div className="content_media">
                <Html>{`<div style="padding:56.25% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/647638652?h=ad453818cd&loop=1&title=0&byline=0&portrait=0" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>`}</Html>
                <div className="commentbox st1"><Typograff>{`Карен Саркисов — об открытии «ГЭС-2» и концепции сезона «”Санта-Барбара”. Как не поддаться колонизации?»`}</Typograff></div>
              </div>
              </>
  },
  
  {
    id: "dec_4",
    date: "4 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Открытие сезона. «Санта-Барбара».<br/>Живая скульптура Рагнара Кьяртанссона».</b><br/>До 13 марта 2022 года</p>
                <p>Проект «Санта-Барбара». Живая скульптура Рагнара Кьяртанссона» стал основой для всего первого сезона. Через обращение к американскому сериалу художник рефлексирует над моментом зарождения современной России с помощью объекта популярной культуры.</p>
                <p>Задумывая проект, команда взяла в качестве референса логику съемки «Санта-Барбары»: один съемочный день — одна серия. В реалиях сериального кинопроизводства это почти невозможно, поэтому здесь сверхзадача — съемка с одного дубля. Почти весь оригинальный сериал снимался в съемочном павильоне — так и для проекта в пространстве «ГЭС-2» построили площадку, где даже пейзажи, сцены в автомобилях и на мотоцикле будут исполнены, как и в 1980-х, полностью в декорациях съемочного сета. Сериал переснимут на русском языке.</p>

                `}
              </Typograff>
              <div className="content_media">
                <Html>{`<div style="padding:56.25% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/644792515?h=4e51a3fbdb&loop=1&title=0&byline=0&portrait=0" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>`}</Html>
                <div className="colorbox"><Typograff>{`
                  <p>Новый опыт для всей команды — работа в плотном графике в течение почти ста дней под руководством режиссера Асы Хельги Хьорлейфсдоттир, каждая новая серия одним съемочным днем и непрерывный поток монтажа. Для того чтобы осуществить задумку Рагнара и не останавливать нашу съемочную «машину», каждый день на площадке будет работать до 70 человек. Не только актеры, но и съемочная группа является частью перформанса (живой скульптуры). Но в отличие от актеров у команды нет сценария, выполнение их прямых обязанностей — это и есть часть перформанса. Задача художника — показать закулисье, обнажить и показать съемочный процесс во всех деталях.</p>
                  <p><b>Ксения Макшанцева,</b> генеральный продюсер «ГЭС-2» и продюсер проекта «Санта-Барбара». Живая скульптура Рагнара Кьяртанссона»</p>`}
                </Typograff></div>
                <div className="commentbox st2"><Typograff>{`Рагнар Кьяртанссон, «Санта-Барбара», 2021-2022, продолжительный перформанс<br/>Режиссер: Аса Хельга Хьорлейфсдоттир остановка перформанса и производство: Lorem Ipsum <br/>Работа создана по заказу и произведена фондом V-A-C, Москва <br/>Предоставлено художником, галереей Luhring Augustine, Нью-Йорк, и галереей i8, Рейкьявик <br/>Авторы оригинального сериала Бриджит и Джером Добсон<br/>© 1984 Телевидение Twentieth Century Fox, все права защищены`}</Typograff></div>
              </div>
              
              </>
  },
  
  {
    id: "dec_5",
    date: "5 декабря",
    //click_id: "click_nov_26",
    hint:"",
    // 
    reactcontent: <>
              <Typograff>
              {`<p><b>Художественный проект «Я моторы гондолы разбираю на части. Карнавал в четырех действиях».</b> АНОНС</p>
                <p>Название отсылает к песне «Карнавала.нет» группы «Мумий Тролль», а сам проект объединяет разные по характеру действа: выставку художественных практик 1990-х и 2000-х, двухчасовую танцевальную процессию «Думаю, вам показалось», серию стендапов «Новые шутки о главном» и ночной рейв с перформативными включениями. Все эти четыре части — об освободительном потенциале карнавала.</p>
                <p>Формат карнавала как жанра показывает мультидисциплинарность художественного контекста сегодня, который все больше приобретает демократичный и широкий характер взаимодействия со зрителем. Слово «карнавал» служит лучшим описанием характера повествования программы, в которой есть место для юмора, сценического перевоплощения, яркой демонстрации / показа, динамики действия и разнообразности форм.</p>

                `}
              </Typograff>
              <div className="content_media">
                <Html>{`<div style="padding:56.25% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/647638275?h=afc2bf2fd0&loop=1&title=0&byline=0&portrait=0" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>`}</Html>
                
                <div className="commentbox"><Typograff>{`Андрей Паршиков о проекте «Я моторы гондолы разбираю на части. Карнавал в четырех действиях»`}</Typograff></div>
              </div>
              
              </>
  },
  
  {
    id: "dec_6",
    date: "6 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Выставка “Я моторы гондолы разбираю на части. Карнавал в четырех действиях”.</b><br/>До 13 марта 2022 года</p>
                <p>Выставка «Я моторы гондолы разбираю на части» — историческая часть большой одноименной программы. С помощью разных видов художественных форм выставка пересматривает прошлое, будто примеряя его костюмы.</p>
                <p>Кураторы: Мария&nbsp;Крамар, Андрей&nbsp;Паршиков, Ольга&nbsp;Цветкова, Елена&nbsp;Яичникова.</p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="3" id="dec_6" comments={['Ольга Чернышева, «Отображения тонкого вида», фильм 16 мм, переведенный в цифровой формат, 2021', 'Катя Филиппова, головной убор для шоу «Полоний»', 'Ульяна Подкорытова, «Táмотка», 2021 Фото Павел Смирнов' ]}/>
                
              </div>
              
              </>
  },
  
  {
    id: "dec_7",
    date: "7 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Библиотека и кафе.</b> На территории Дома культуры есть место для самостоятельного исследования — открытая публичная библиотека, где собрание книг пополняется по мере «развития» трехлетней программы «Святые варвары». Это библиотека по искусству, отчасти созданная непосредственно художниками, и помимо тематических изданий по музыке, хореографии, кино, перформансу или театру на полки попадают книги самых разных дисциплин (восточная философия, поэзия, физика, биология или астрология), оказавшие влияние на практику современных художников.</p>
                <p>Самое интересное в новой институции то, как представлена метафора времени в ней: вечно преобразующийся текучий процесс, где, подобно сериалу, один сюжет перетекает в другой, а линия нарратива постоянно соизмеряется с современностью. </p>
                <p>Даже ресторан на территории «ГЭС-2» может стать самостоятельной активностью пространства. За экспериментальную кухню отвечает бренд-шеф Эмануэле Поллини, который создал «земную кухню», основанную на особом внимании к овощам и травам и сохранении природного вкуса ингредиентов.</p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_7"/>
              </div>
              
              </>
  },
  
  {
    id: "dec_8",
    date: "8 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>День с детьми.</b> Важная часть концепции Дома культуры — пространство «Ателье». Это игровая и познавательная зона, которую создали художница Света Шуваева и архитектор Ольга Рокаль. Ателье географически поделено на две зоны: «Лес» — игровая площадка для развлечения, и «Мастерская» — место для занимательных исследований.</p>
                <p>Программа «Как будто», посвященная игре и импровизации, частично развернется в пространстве «Ателье» и будет состоять из трех частей:</p>
                <p>1. «Игровые исследовательские карточки», которые приготовили дизайнер Леша Ивановский, психолог Женя Стратийчук и иллюстратор Тим Яржомбек. С их помощью можно поговорить об искусстве, узнать друг друга, помечтать и подурачиться — и еще лучше познакомиться с основной программой «ГЭС-2». Карточки можно будет получить на стойке регистрации.</p>
                <p>2. Двухдневный фестиваль игры и игр «Какие правила?», который пройдет 22-23 января 2022 года под сокураторством Дмитрия Веснина. Фестиваль вернет людей всех возрастов во времена детства — когда веселье было легкодостижимо через адаптивность к окружающему миру.</p>
                <p>3. «Воображаемые друзья» — воркшопы, где участники 6–12 лет будут создавать воображаемых друзей, — пройдут в феврале–марте 2022 года.</p>

                `}
              </Typograff>
              <div className="content_media">
                <Html>{`<div style="padding:56.25% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/647634549?h=1b063bea9c&loop=1&title=0&byline=0&portrait=0" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>`}</Html>
                
                <div className="commentbox"><Typograff>{`Катя Порутчик — о программе «Как будто», посвященной игре и импровизации`}</Typograff></div>
              </div>
              
              </>
  },
  
  {
    id: "dec_9",
    date: "9 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>В Москву! В Москву! В Москву!</b><br/>До 13 марта 2022 года</p>

                <p>Выставка «В Москву! В Москву! В Москву!» является результатом диалога кураторов Рагнара Кьяртанссона и Ингибьорг Сигурьонсдоттир с другими художниками. Она продемонстрирует бесчисленные варианты происхождения и развития мотивов повторения, силы искусства и вымысла, смелости и беззащитности человека, снимающего с себя маску. </p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="2" id="dec_9" comments={['Рагнар Кьяртанссон, «Три сестры» (интерпретация потеряннои фотографии Джея Ранелли, сделанной около 1990 г.), 2021', 'Рагнар Кьяртанссон']}/>
                
              </div>
              
              </>
  },
  
  {
    id: "dec_10",
    date: "10 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>«Я моторы гондолы разбираю на части. Карнавал в четырех действиях»: «Táмотка»</b></p>

                <p>Внутри первого действия большой карнавальной программы «Я моторы гондолы разбираю на части» 10 декабря в 20:00 пройдет перформанс «Táмотка». Автор проекта Ульяна Подкорытова создает современную сказку с эстетическими отсылками к фольклорным традициям Русского Севера. Перформанс напоминает сюжет фильма про супергероя с добродетелями, проявленными в фантазийном гротескном пространстве.</p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="3" id="dec_10" comments={['Ульяна Подкорытова, «Táмотка», 2021 Фото Павел Смирнов', 'Ульяна Подкорытова, «Táмотка», 2021 Фото Павел Смирнов', 'Ульяна Подкорытова, «Táмотка», 2021 Фото Павел Смирнов' ]}/>
                
              </div>
              
              </>
  },
  
  {
    id: "dec_11",
    date: "11 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>«Новые шутки о главном». Стендап-лекции: первый вечер.</b></p>
                <p>Проект «Новые шутки о главном» — до 19 февраля 2022 года.</p>
                <p>Юмор — неотъемлемый атрибут любого гуляния. Эта часть карнавала представлена тремя стендап-лекциями, где комики расскажут о своем понимании природы юмора и о том, что повлияло на их собственный стиль. В 2000-х стендап заимствовали с Запада, но в России формат ассимилировался и приобрел черты отечественной традиции шуток и подколов. </p>
                <p>11 декабря в 19:00 пройдет стендап-лекция, на которой Миша Кострецов расскажет, чем современная российская комедия отличается от советской, Вова Бухаров объяснит, как и почему одни комики более успешны, чем другие, а Дима Гаврилов порассуждает о том, можно ли считать стендап-комедию искусством.</p>

                `}
              </Typograff>
              <div className="content_media">
                
                <div className="colorbox c_blue"><Typograff>{`
                  <p>– Сколько нужно кураторов, чтобы открыть «ГЭС-2»?<br/>– n+1</p>
                  <p><b>Мария Крамар</b> </p>`}
                </Typograff></div>
                
                <div className="colorbox "><Typograff>{`
                  <p>Мои любимые шутки делятся на три вида: контекстуальные, кринжовые и несмешные. Последние как будто бы самые удивительные: может пройти много лет, шутка все не выходит из головы, а тебе по-прежнему несмешно. Поэтому в своем стендапе я бы рассказал шутку из детства, ею поделился со мной двоюродный брат: «Два ганнибала едят клоуна. Один говорит другому: “Хм, какой-то несмешной у него вкус”». Вроде и понял ее давно, а все равно несмешно.</p>
                  <p><b>Евгений Ухмылин</b></p>`}
                </Typograff></div>
                
                <div className="colorbox c_dblue"><Typograff>{`
                  <p>Мой стендап состоял бы из старых анекдотов и презентации с мемами. Все это было бы нарочно неловко и с нервными смешками. Загуглите, пожалуйста, «бобер, выдыхай» и «антоновка, анекдот» — я помню, как смеялся буквально до слез, читая эти анекдоты вслух с друзьями.</p>
                  <p><b>Степа Овчинников</b></p>`}
                </Typograff></div>
                
              </div>
              
              </>
  },
  
  {
    id: "dec_12",
    date: "12 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Шок и слава.</b> Фестиваль-конференция посвящен анализу экстремальных проявлений, которые случаются при взаимодействии с&nbsp;художественными высказываниями. Почему иногда художественные произведения вызывают радикальные чувства отвращения, а&nbsp;иногда&nbsp;&mdash; влюбленности? Эта часть спектра чувств часто остается без внимания и&nbsp;маргинализируется авторитетами. Российские и&nbsp;зарубежные социологи, философы и&nbsp;историки обсудят, как разные формы художественных практик вызывают мобилизационный потенциал у&nbsp;зрителей.</p>

                <p>Программа &laquo;Шока и&nbsp;славы&raquo;&nbsp;&mdash; это ответ на&nbsp;видеоинсталляцию Рагнара Кьяртанссона &laquo;Грозный-прегрозный&raquo;. В&nbsp;ней художник обращается к&nbsp;истории нападения на&nbsp;полотно Ильи Репина &laquo;Иван Грозный и&nbsp;сын его Иван 16&nbsp;ноября 1581&nbsp;года&raquo;.</p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="4" id="dec_12"  fileType=".gif"/>
              </div>
              
              </>
  },
  
  {
    id: "dec_13",
    date: "13 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>«Ощутимое присутствие».</b><br/>До 13 марта 2022 года</p>

                <p>Команда Playtronica при участии группы экспертов и художников и кураторстве Кати Порутчик и Полины Зотовой создала комнату сенсорных впечатлений «Ощутимое присутствие». Интерактивная среда комнаты помогает «раскачать» чувственную природу посетителя. Воздействие пространства на сенсорику позволит не только испытать новый опыт (и повзаимодействовать со своего рода «аттракционным искусством»), но и оттренировать спектр навыков, важных для взаимодействия с искусством.</p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_13"/>
                
                <div className="colorbox c_dblue"><Typograff>{`
                  <p>Идея проекта — создать в «ГЭС–2» «тренажерный зал» для базовых чувств восприятия. Баланс, тактильность, звуки, зрение, обоняние. </p>
                  <p>Упражнения для ощущения своего тела и позиции в пространстве, зарядка на осязание предметов и восприятие звуковых и световых вибраций, тренировка восприятия запахов и медитация в темноте. Именно так устроено пространство комнаты сенсорных впечатлений. Это наш главный интерактивный объект в пространстве. Здесь зрители могут создавать последовательности стимулов, комбинации из звуков, световых импульсов и тактильных ощущений. Это такой синтезатор, на котором можно исполнять синестетические этюды, предназначенные для восприятия разными органами чувств одновременно. Кандинский и Скрябин были бы довольны.</p>
                  <p><b>Саша Пас,</b> Playtronica</p>`}
                </Typograff></div>
              </div>
              
              </>
  },
  
  {
    id: "dec_14",
    date: "14 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Школа эмоционального здоровья.</b><br/>До 13 марта 2022 года</p>
                <p>Название хоть и шуточное, но отображает современную потребность: человек желает научиться корректно реагировать на сложные ситуации, эффективно вступать в коммуникацию и применять свою психологическую осознанность. Встречи с психологами и чтение литературы на тему «здорового» эмоционального восприятия стали органичными практиками жителей мегаполисов. Однако интересно посмотреть на феномен «селф-хелп» с точки зрения культуры и социума: почему именно сейчас необходимо получать новые знания о своей психике, почему время подталкивает к большей эмоциональной осознанности.</p>
                <p>14 декабря в 19:00 пройдут лекция и беседа «Эмоциональный интеллект и популярная психология». Речь пойдет о возросшем интересе к эмоциональному менеджменту и о том, как этот тренд влияет на построение отношений между людьми. Участвуют социолог и психолог Ева Иллуз, социолог и журналистка Полина Аронсон, сооснователь и генеральный директор онлайн-сервиса психологической помощи YouTalk Анна Крымская. Модератор — журналистка и соосновательница подкаста НОРМ Настя Курганская.</p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_14"/>
              </div>
              
              </>
  },
  
  {
    id: "dec_15",
    date: "15 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>«Еще одну: к опыту сериальной культуры»</b><br/>До 9 марта 2022 года</p>
                <p>Возросшая популярность жанра сериала, безусловно, имеет свое влияние на современный культурный контекст и диктует новые паттерны взаимоотношения с досугом и с жизнью в целом. Как устроен сериал? Как он изменил наш досуг? Как он формирует наше отношение к пространству и времени? Становится ли он новой терапевтической формой: справиться со своим одиночеством? Как развивается кинематограф как жанр искусства через сериал? В цикле бесед с социологами, кинокритиками, философами и журналистами раскроются эти и другие темы, посвященные феномену сериала.</p>
                <p>15 декабря в 20:00 пройдет одна из бесед цикла — «Всемирная история: качественный сериал или мыльная опера?». Философ и историк Андрей Тесля, философ Андрей Олейников и художник Михаил Максимов совместно с участниками постараются ответить на вопрос, как сериалы конструируют исторический нарратив и каким образом описывают историю и вписывают историю в себя. Мероприятие 16+.</p>

                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_15"/>
              </div>
              
              </>
  },
  
  {
    id: "dec_16",
    date: "16 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Рейв.</b><br/>АНОНС</p>
                <p>На подземной парковке «ГЭС-2» с диджей-сетами и концертами выступят артисты, раскрывающие динамическую сторону карнавала «Я моторы гондолы разбираю на части». Все будет происходить в ночь с 22 на 23 января.</p>
                <p>Усиленный звук, ритмичные движения, яркие способы самовыражения погрузят в атмосферу гуляния. Это будет переживание особого телесного опыта через ощущения себя в пространстве вибрационного звука, мерцающего света и коллективного дыхания. Куратор проекта Никита Рассказов говорит, что на рейве тело как минимальная единица становится проводником звука и ритма с их преобразующей силой.</p>

                `}
              </Typograff>
              <div className="content_media">
                <Html>{`<iframe src="https://open.spotify.com/embed/playlist/0aWm5tlnNanidA6msZW2Kb?utm_source=generator&theme=0" width="250" height="80" frameBorder="0" allowfullscreen="" allow="autoplay; clipboard-write; encrypted-media; fullscreen; picture-in-picture"></iframe>`}</Html>
                <SlickSlider numOfSlides="1" id="dec_16"/>
              </div>
              
              </>
  },
  
  {
    id: "dec_17",
    date: "17 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Показ мод и поп-ап магазин винтажной одежды.</b> В программе под кураторством Александры Тумаркиной и сокураторством Vintage Marketplace — показ мод 17 декабря, поп-ап-маркет 18-19 декабря и обсуждения современных инструментов для экологичного использования вещей.</p>
                <p>На показе будут исключительно винтажные вещи, отсылающие к отечественному прошлому 1990-х — к временам бытования «Санта-Барбары» на телевидении. Авторы не стремятся показать яркость стиля прошлого, а ретроспективно показывают зарождение современной русской моды: очаги влияния на нее, способы ассимилирования, обретение своего почерка.</p>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_17"/>
                <div className="commentbox st2"><Typograff>{`Courtesy of Bloomsbury Publishing Plc. / Daniel Simon/Gamma-Rapho via Getty Images /<br/>Pierre Vauthey/Sygma/Sygma via Getty Images /  Piere Guillaud/AFP via Getty Images`}</Typograff></div>
              </div>
              
              </>
  },
  
  
  {
    id: "dec_18",
    date: "18 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>«Машина времени: 1986–2000».</b><br/>До 13 марта 2022 года</p>

                <p>В Доме культуры идет программа «Машина времени: 1986–2000». Это 14 «остановок» — кинопоказов и обсуждений того, как развивался репрезентативный образ России в сравнении с другими странами. 18 декабря в 16:00 покажут фильм «В субботу» Александра Миндадзе. </p>

                `}
              </Typograff>
              <div className="content_media">
                
                <div className="colorbox c_dblue"><Typograff>{`
                  <p>Что если взглянуть на недавнюю историю страны стереоскопически? Отклониться от оси «Россия — условный Запад» (или не менее условный Восток) и, как следствие, отказаться от концепций-близнецов — особого пути и догоняющего развития? Так, пару «Любви» Тодоровского составляет «Мой личный штат Айдахо», а на культового «Брата» приходится дебют Цзя Чжанкэ «Карманник». Особняком стоит молчаливый и отчасти московский травелог Шанталь Акерман «С востока». Миллениум проходит под знаком встречи Григория Константинопольского и Клер Дени.</p>
                  <p><b>Кирилл Адибеков,</b> куратор программы</p>`}
                </Typograff></div>
              </div>
              
              </>
  },
  
  {
    id: "dec_19",
    date: "19 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>«Машина времени: 1986–2000».</b><br/>До 13 марта 2022 года</p>
                <p>«Машина времени» — это в первую очередь игра. За каждый год отвечают два фильма, один из которых снят на русском, другой — на любом иностранном языке. При этом необязательно фильм датируется 1986 годом: так, «В субботу» Александра Миндадзе рассказывает о Чернобыльской трагедии 2011-го. Обращены в прошлое недавний байопик «Нико, 1988» Сузанны Никкьярелли и пастиш на девяностые Алексея Балабанова «Жмурки» (2005). </p>
                <p>19 декабря в 16:00 покажут фильм Эдварда Янга «Вселяющий страх» (1986). </p>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_19"/>
                <div className="commentbox "><Typograff>{`Кадр из фильма Эдварда Янга «Вселяющий страх» (1986)`}</Typograff></div>
              </div>
              
              </>
  },
  
  {
    id: "dec_20",
    date: "20 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>«Думаю, вам показалось». Танцевальная процессия.</b><br/>АНОНС</p>
                <p>Кульминация проекта «Я моторы гондолы разбираю на части» — танцевальное шествие, которое пройдет 6 марта. Здесь тема карнавала становится основой для перформанса, драматургия которого развернется по всему пространству Дома культуры. Непрерывное движение танцевальной процессии направлено на достижение коллективной радости, которая стала сложнодоступной. Произойдет рождение карнавала в его современной форме. </p>
                <p>Актуален и сюжет перформанса: это обращение к состоянию общества в период пандемии. Хореограф Татьяна Чижикова, сценограф Полина Бахтина и художник по звуку Сергей Касич создают атмосферу ограничений ковидного времени, когда каждый выход из дома сопровождается сложностями и дискомфортом. </p>
                <p>Зрители смогут присоединиться к процессии и почувствовать себя частью творящегося перформанса, внутри которого станет возможным напомнить себе об ощущении телесной связанности с другими. </p>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_20"/>
              </div>
              
              </>
  },
  
  {
    id: "dec_21",
    date: "21 декабря",
    //click_id: "click_nov_26",
    hint:"",

    reactcontent: <>
              <Typograff>
              {`<p><b>Сцены из русской культуры.</b><br/>АНОНС</p>
                <p>Программа сложилась как комментарий к работе Рагнара Кьяртанссона «Сцены из западной культуры» — серии видео с идеальными рекламными клише западного образа жизни: загородный дом с часами с кукушкой и собакой, романтический ужин в ресторане, мужчина и женщина в минималистичной белой спальне. Стремление вести подобный образ жизни или, по крайней мере, подражать ему философ Ален Бадью определил термином «желание Запада». Оставаясь недостижимым, оно порождает «желание традиции». Можем ли мы найти самоопределение за пределами этой оппозиции и насколько вообще легитимно противопоставление традиции и современности? </p>
                <p>Программа действует с 23 января по 13 марта.</p>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="4" id="dec_21" comments={['Н.А. Римский-Корсаков, «Царская невеста» (реж. Д.Черняков, Берлинская государственная опера, 2013 г.). Кинопоказ', '«Прощай, малышка. Заметка о выходе из планетарного патриархата»<br/>Чтение текста Антонии Маячи с Лесей Прокопенко', '«Колыбельная». Иммерсивный перформанс<br/>Светланы Петрийчук и Юрия Шехватова', 'Хореографическая лаборатория «Танки и лебеди»<br/>Татьяны Гордеевой и Екатерины Бондаренко' ]}/>
                
              </div>
              
              </>
  },
  
  {
    id: "dec_22",
    date: "22 декабря",
    //click_id: "click_nov_26",
    hint:"",

    reactcontent: <>
              <Typograff>
              {`<p><b>«Я сама». Серия воркшопов для женщин.</b><br/>АНОНС</p>
                <p>Серия воркшопов художницы Наталии Никуленковой посвящена женщинам, занимающимся аффективным трудом. Аффективный труд — это работа, направленная на благоприятное изменение эмоционального состояния других людей, находящихся в хосписах, домах престарелых, больницах. Этот вид деятельности воспринимается как «исключительно женский», даже несмотря на то, что эмоциональная и физическая нагрузка здесь может зашкаливать.</p>
                <p>Участники воркшопов будут делиться своим опытом и переживаниями, а еще придумают комикс — таким образом, изобретение культурного объекта создаст условия для взаимоподдержки.</p>
                <p>Воркшопы пройдут 16, 23 и 30 января.</p>
                `}
              </Typograff>
              <div className="content_media">
                <div className="colorbox c_dblue"><Typograff>{`
                  <p>Мы занимаемся искусством ради собственного ментального выживания. Ради того, чтобы не чувствовать, как вокруг разворачивается нечто фатальное, а ты ничего с этим не можешь сделать. На мастер-классах мы постараемся создать поле для комфортного и доверительного обмена личным опытом, который может послужить материалом для комиксов о женщинах-супергероинях, преодолевающих повседневные трудности.</p>
                  <p><b>Наталия Никуленкова,</b> художница, ведущая воркшопов «Я сама»</p>`}
                </Typograff></div>
                <SlickSlider numOfSlides="3" id="dec_22" comments={['Спектакль «Коммуна прекрасных душ», Наталья Никуленкова в рамках художественной инициативы «Союз выздоравливающих», 2019', '«Захваченные тела» (Дневник девочки заключенной),<br/>Наталья Никуленкова, 2019', '«Разомкнутость», Наталья Никуленкова в рамках художественной инициативы «Союз выздоравливающих», 2015' ]}/>
              </div>
              
              </>
  },
  
  {
    id: "dec_23",
    date: "23 декабря",
    //click_id: "click_nov_26",
    hint:"",

    reactcontent: <>
              <Typograff>
              {`<p><b>«Долго и счастливо (вариации на тему счастливого финала)».</b><br/>АНОНС </p>
                <p>Идея о временных трудностях сегодня в обмен на непременное счастливое завтра, столь важная для советского проекта («А сегодня что для завтра сделал я?»), совершенно отсутствует в текущей риторике. «Возможно ли сегодня обрести надежду на счастливый финал?» — ставят вопрос кураторы программы и последовательно предлагают и переписывают различные варианты ответа в форме киносценария. </p>
                <p>Одна из вариаций, «Мертвый попугай», отсылает к одноименному скетчу комик-группы «Монти Пайтон» и выстроена вокруг теории salvage-панка (от англ. salvage — «спасать») и сюжетов о мире после катастрофы. Salvage-панк, основанный на гипотезе, что мир уже посткатастрофичен, полагает, что сегодня остро необходим апокалипсис, но не в смысле конца света, а в смысле откровения. Увидеть действительное состояние мира и перестать повторять, что попугай всего лишь спит, — то есть преподносить катастрофичность как «временные сбои» во вполне рабочей и нормальной системе. В рамках сессии пройдет лекция теоретика современного искусства Бориса Клюшникова, а также серия кинопоказов «Монти Пайтон». </p>
                <p>Программа действует с 31 января по 13 марта.</p>
                `}
              </Typograff>
              <div className="content_media">
                <div className="colorbox c_dblue"><Typograff>{`
                  <p>Мы занимаемся искусством ради собственного ментального выживания. Ради того, чтобы не чувствовать, как вокруг разворачивается нечто фатальное, а ты ничего с этим не можешь сделать. На мастер-классах мы постараемся создать поле для комфортного и доверительного обмена личным опытом, который может послужить материалом для комиксов о женщинах-супергероинях, преодолевающих повседневные трудности.</p>
                  <p><b>Наталия Никуленкова,</b> художница, ведущая воркшопов «Я сама»</p>`}
                </Typograff></div>
                <SlickSlider numOfSlides="3" id="dec_23" comments={['Кадр из фильма Алексея Балабанова «Я тоже хочу» (2012)', 'Кадр из скетча «Мертвый попугай», «Летающий цирк Монти Пайтона»', ' ' ]}/>
              </div>
              
              </>
  },
  
  {
    id: "dec_24",
    date: "24 декабря",
    //click_id: "click_nov_26",
    hint:"",

    reactcontent: <>
              <Typograff>
              {`<p><b>Невероятные серии.</b><br/>АНОНС </p>
                <p>Часть программы «Машина времени» — киномарафоны «Невероятные серии» с картинами, не имеющими артикулированного конца и начала. Центральным фильмом программы куратор Кирилл Адибеков видит картину «Цветок» Мариано Льинаса (Mariano Llinás, La Flor, 2018). В течение 14 часов фильм представляет разные сюжетные линии, каждая из которых отвечает за свой жанр, а одни и те же актеры создают ретроспективную панораму всего кино.</p>
                <p>Зритель может выбрать: смотреть двухдневный марафон сериями или с утра и до вечера запоем. </p>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_24"/>
                <div className="commentbox "><Typograff>{`Кадр из фильма Мариано Льинаса «Цветок» (2018)`}</Typograff></div>
              </div>
              
              </>
  },
  
  {
    id: "dec_25",
    date: "25 декабря",
    //click_id: "click_nov_26",
    hint:"",

    reactcontent: <>
              <Typograff>
              {`<p><b>Рейв-елка.</b><br/>До 26 декабря 2021 года </p>
                <p>«ГЭС-2» подготовил семейное событие к Новому году — дневной рейв для детей и их родителей. С диджей-сетами, подарками, мейкап-станциями и воркшопами по кастомизации одежды и созданию trash jewelry (украшений из переработанного мусора).</p>
                <p>Для родителей это возможность нарядиться, выйти из дома и послушать настоящую музыку вместо песен из мультиков, для детей — побыть в веселой компании. Это будет удовольствие для всех без компромиссов. </p>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_25"/>
                <div className="commentbox "><Typograff>{`Анна и Виталий Черепановы, «Рейв-елка»`}</Typograff></div>
              </div>
              
              </>
  },
  /*
  {
    id: "dec_25",
    date: "25 декабря",
    //click_id: "click_nov_26",
    hint:"",
    
    reactcontent: <>
              <Typograff>
              {`<p><b>Рейв-елка.</b><br/>До 26 декабря 2021 года</p>
                <p>«ГЭС-2» подготовил семейное событие к Новому году — дневной рейв для детей и их родителей. С диджей-сетами, подарками, мейкап-станциями и воркшопами по кастомизации одежды и созданию trash jewelry (украшений из переработанного мусора).</p>
                <p>Для родителей это возможность нарядиться, выйти из дома и послушать настоящую музыку вместо песен из мультиков, для детей — побыть в веселой компании. Это будет удовольствие для всех без компромиссов.</p>
                `}
              </Typograff>
              <div className="content_media">
                <SlickSlider numOfSlides="1" id="dec_25"/>
                <div className="commentbox"><Typograff>{`Анна и Виталий Черепановы, «Рейв-елка»`}</Typograff></div>
              </div>
              </>
  },

 /* {
    id: 3,
    date: "1.11.2021",
    click_id: "click_nov_27",
    view_id: "view_3",
    head: "video iframe",
    content: `<h2>Video Iframe</h2>`,
    iframe: `<iframe id="ytplayer" type="text/html" width="480" height="270"
    src="https://www.youtube.com/embed/ubc8MovGD7w"
    frameborder="0" allowfullscreen>`,
    reactcontent: ""
  },

  {
    id: 4,
    date: "3.11.2021",
    head: "react component example",
    content: `
              <h2>LinkGA</h2>
              `,
    reactcontent: (
      <LinkGA action="item click">
        <a className="a_text a_main" rel="noreferrer noopener" href="#">
          <div>Ccылка в контенте</div>
        </a>
      </LinkGA>
    )
  },

  {
    id: 5,
    date: "1.11.2021",
    head: "Slick predefined elements",
    content: ``,
    reactcontent: (
      <Slider {...slickSettings}>
        <div>
          <h3>1</h3>
        </div>
        <div>
          <h3>2</h3>
        </div>
        <div>
          <h3>3</h3>
        </div>
        <div>
          <h3>4</h3>
        </div>
        <div>
          <h3>5</h3>
        </div>
        <div>
          <h3>6</h3>
        </div>
      </Slider>
    )
  },

  {
    id: 6,
    date: "1.11.2021",
    head: "Slick array",
    content: ``,
    reactcontent: (
      <Slider {...slickSettings}>
        {[1, 2, 3, 4].map((item, index) => (
          <div key={index}>
            <h1>{item}</h1>
          </div>
        ))}
      </Slider>
    )
  },

  {
    id: 7,
    date: "1.11.2021",
    view_id: "view_1",
    head: "long html",
    content: ` 
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>
              <h2>Long HTML</h2>

              <a className="a_text a_main"  rel="noreferrer noopener" href="https://www.google.com" target="_blank"  rel="noreferrer noopener">
                <div>Ccылка в контенте</div>
              </a>`,
    iframe: "",
    reactcontent: ""
  },

  {
    id: 8,
    date: "1.11.2021",
    head: "Slick Slider Component",
    content: ``,
    reactcontent: <SlickSlider />
  },

  {
    id: 10,
    date: "3.11.2021",
    head: "react component - Typograf",
    content: `
              <h2>Typograf</h2>
              `,
    reactcontent: (
      <Typograff>
        {`<p>
          Проснувшись однажды утром после беспокойного сна, Грегор Замза
          обнаружил, что он у себя в постели превратился в страшное насекомое.
        </p>

        <p>
          Лежа на панцирнотвердой спине, он видел, стоило ему приподнять голову,
          свой коричневый, выпуклый, разделенный дугообразными чешуйками живот,
          на верхушке которого еле держалось готовое вот-вот окончательно
          сползти одеяло. Его многочисленные, убого тонкие по сравнению с
          остальным телом ножки беспомощно копошились у него перед глазами.
        </p>

        <p>
          «Что со мной случилось?» – подумал он. Это не было сном. Его комната,
          настоящая, разве что слишком маленькая, но обычная комната, мирно
          покоилась в своих четырех хорошо знакомых стенах. Над столом, где были
          разложены распакованные образцы сукон – Замза был коммивояжером, –
          висел портрет, который он недавно вырезал из иллюстрированного журнала
          и вставил в красивую золоченую рамку.
        </p>

        <p>
          На портрете была изображена дама в меховой шляпе и боа, она сидела
          очень прямо и протягивала зрителю тяжелую меховую муфту, в которой
          целиком исчезала ее рука. Затем взгляд Грегора устремился в окно, и
          пасмурная погода – слышно было, как по жести подоконника стучат капли
          дождя – привела его и вовсе в грустное настроение. «Хорошо бы еще
          немного поспать и забыть всю эту чепуху», – подумал он, но это было
          совершенно неосуществимо, он привык спать на правом боку, а в
          теперешнем своем
        </p>`}
      </Typograff>
    )
  }*/
];

export default db;
